Revit 2027 API
IFCProductWrapper.AddAnnotation Method
 Adds an annotation handle to associate with the IfcProduct in this wrapper.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddAnnotation(
	IFCAnyHandle annoHnd,
	IFCLevelInfo levelInfo,
	bool relateToLevel
)
Public Sub AddAnnotation (
	annoHnd As IFCAnyHandle,
	levelInfo As IFCLevelInfo,
	relateToLevel As Boolean
)
public:
void AddAnnotation(
	IFCAnyHandle^ annoHnd,
	IFCLevelInfo^ levelInfo,
	bool relateToLevel
)
member AddAnnotation :
        annoHnd : IFCAnyHandle *
        levelInfo : IFCLevelInfo *
        relateToLevel : bool -> unit
Parameters
annoHnd IFCAnyHandle
 The annotation handle.
levelInfo IFCLevelInfo
 Information on the associated level. Optional, can be null.
relateToLevel Boolean
 True to relate the annotation to the level, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.
See Also
Reference
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace